{
    "HomePage": {
      "home": "Home",
      "about": "About",
      "testimonials": "Testimonials",
      "donate": "Donate Now",
      "mission": "Bringing God's Word to Every Language",
      "missionText": "Join our mission to translate the Bible into every language, reaching communities that have never had Scripture in their heart language.",
      "learnMore": "Learn More",
   "bibleTranslationProjects": "Bible Translation Projects",
  "newTestamentTranslations": "Completed translations of the New Testament",
  "oldTestamentTranslations": "Completed translations of the Old Testament",
  "printedTrialEditions": "Printed Trial Editions",
  "ourMissionTitle" : "Our Mission",
  "ourMissionDescription1" : "We believe that everyone should have access to God&apos;s Word in their heart language. That's why we partner with local churches to translate the Bible accurately and faithfully, ensuring it remains true to its original meaning.",
  "ourMissionDescription2" : "With your support, we can accelerate Bible translation projects worldwide, bringing Scripture to  communities that have waited for generations to experience God's Word in their own language."



    },
    "Donation" :{
      "title" : "Support Bible Translation",
      "description" : "By donating, you will directly impact communities that have never heard the Word of God. Your contribution will fund essential translation efforts and outreach initiatives.",
      "amount" : "Donation Amount",
      "customAmount" : "Custom Amount",
      "completeButton" : "Complete Your Donation",
      "notes" : "You are entering amounts in USD. Our system will convert and display the amount in IDR when you proceed to choose your payment method."
    },
    "PersonalInformation" : {
      "title" : "Personal Information",
      "firstName" : "First Name",
      "firstNamePlaceholder" : "Enter your first name",
      "lastName" : "Last Name",
      "lastNamePlaceholder" : "Enter your last name",
      "email" : "Email Address",
      "emailPlaceholder" : "Enter your email",
      "phoneNumber" : "Phone Number",
      "phoneNumberPlaceholder" : "Enter your phone number",
      "addressInformation" : "Address Information",
      "streetAddress" : "Street Address",
      "streetAddressPlaceholder" : "Enter your street address",
      "country" : "Country",
      "countryPlaceholder" : "Enter your country",
      "city" : "City",
      "cityPlaceholder" : "Enter your city",
      "postalCode" : "Postal Code",
      "postalCodePlaceholder" : "Enter your postal code",
      "requiredFields" : "Required fields"
    },
    "Testimonials": {
      "title" : "Testimonials",
      "description" : "Hear from those whose lives have been changed by receiving Gods Word in their heart language.",
      "kemtuikQuote" : "In my deepest grief, I turned away from God, but through His Word, He called me back. 1 Samuel 2:6 reminded me that life is in His hands. Now, I translate not just words, but a message that strengthens and transforms lives. God is faithful—He never abandons us.",
      "sukuLautQuote" : "I was torn between fishing to provide for my family or joining Bible translation training. Praise God, I chose to translate His Word into the Suku Laut language. For the first time, I read the Bible in my own language—and I was one of those who translated it. It filled my heart with joy!",
      "bakatiRaraQuote" : "A historic moment for the Bakati’ Rara people! After dedicated efforts since February 2023, the New Testament was completed by August 2024. The launch at GKKI Bukit Sion Church was special—the first worship service entirely in Bakati’ Rara, proving the Bible’s deep impact on faith and culture.",
      "language" : "Language",
      "readFullStory" : "Read Full Story"

    }
  }